OpenFOAM-4/chapter8/coFlowFlame2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0  0 0)	                          // vertex number 0
    (1.8 0 0)	                          // vertex number 1
  
    (0   0.004996954   -0.000174497  )    // vertex number 2 
    (1.8 0.004996954   -0.000174497)	  // vertex number 3 
       
    (0   0.004996954   0.000174497)       // vertex number 4 
    (1.8 0.004996954   0.000174497)         // vertex number 5 

    (0   0.224862936   -0.007852387  )    // vertex number 6 
    (1.8 0.224862936   -0.007852387)        // vertex number 7 
         
    (0   0.224862936   0.007852387)      // vertex number 8   
    (1.8 0.224862936   0.007852387)        // vertex number 9 
);

blocks
(
    hex (0 1 3 2 0 1 5 4) (300 10 1) simpleGrading (1 1 1)
    hex (2 3 7 6 4 5 9 8) (300 90 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    fuel
    {
        type patch;
        faces
        (
            (0 2 4 0)
        );
    }
    air
    {
        type patch;
        faces
        (
            (4 8 6 2)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 3 5 1)
            (3 7 9 5)
        );
    }
    axis
    {
        type symmetryPlane;
        faces
        (
            (0 1 1 0)
        );
    }
    wallUp
    {
        type wall;
        faces
        (
            (6 7 9 8)
        );
    }
    front-1
    {
        type wedge;
        faces
        (
            (4 5 9 8) 
        );
    }
    front-2
    {
        type wedge;
        faces
        (
            (0 1 5 4)  
        );
    }
    back-1
    {
        type wedge;
        faces
        (
            (0 2 3 1)
        );
    }
    back-2
    {
        type wedge;
        faces
        (
            (2 6 7 3)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
